Revit 2027 API
View3D.CanSaveOrientation Method
 Returns true if the View3D's orientation can be saved, false otherwise.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanSaveOrientation()
Public Function CanSaveOrientation As Boolean
public:
bool CanSaveOrientation()
member CanSaveOrientation : unit -> bool
Return Value
Boolean
 True if the View3D's orientation can be saved, false otherwise.
Remarks
 The saved orientation of the default 3D view cannot be overwritten. To convert the default 3D view into a normal 3D view, rename the default 3D view.
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace